zh1vch1k/ugv-control-system/ugv_firmware/Includes/stm32f4xx_hal_conf.h
#ifndef __STM32F4xx_HAL_CONF_H
#define __STM32F4xx_HAL_CONF_H

#ifdef __cplusplus
 extern "C" {
#endif

/* 1. Включенные модули HAL */
#define HAL_MODULE_ENABLED
#define HAL_GPIO_MODULE_ENABLED
#define HAL_RCC_MODULE_ENABLED
#define HAL_CORTEX_MODULE_ENABLED
#define HAL_FLASH_MODULE_ENABLED
#define HAL_PWR_MODULE_ENABLED
#define HAL_DMA_MODULE_ENABLED
#define HAL_UART_MODULE_ENABLED

/* 2. Настройки тактирования и кварцев */
#define HSE_VALUE               25000000U /* Внешний кварц Black Pill: 25 МГц */
#define HSE_STARTUP_TIMEOUT     100U
#define HSI_VALUE               16000000U
#define LSE_VALUE               32768U
#define LSE_STARTUP_TIMEOUT     5000U
#define LSI_VALUE               32000U
#define EXTERNAL_CLOCK_VALUE    12288000U

/* 3. Системные параметры */
#define VDD_VALUE               3300U
#define TICK_INT_PRIORITY       0U
#define USE_RTOS                0U
#define PREFETCH_ENABLE         1U
#define INSTRUCTION_CACHE_ENABLE 1U
#define DATA_CACHE_ENABLE       1U

/* 4. Макрос assert_param (пустой для release/debug без проверок) */
#ifndef assert_param
#define assert_param(expr) ((void)0U)
#endif

/* 5. Подключение заголовков включенных модулей */
#include "stm32f4xx_hal_rcc.h"
#include "stm32f4xx_hal_gpio.h"
#include "stm32f4xx_hal_dma.h"
#include "stm32f4xx_hal_cortex.h"
#include "stm32f4xx_hal_flash.h"
#include "stm32f4xx_hal_pwr.h"
#include "stm32f4xx_hal_uart.h"

#ifdef __cplusplus
}
#endif

#endif /* __STM32F4xx_HAL_CONF_H */
